benchmarks/frontends/fastapi/fetch.log
          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: benchmark.js
     output: pages/fastapi/fetch.log

  scenarios: (100.00%) 1 scenario, 30 max VUs, 2m30s max duration (incl. graceful stop):
           * default: 30 looping VUs for 2m0s (gracefulStop: 30s)


running (2m00.0s), 00/30 VUs, 606874 complete and 0 interrupted iterations
default ✓ [======================================] 30 VUs  2m0s

     data_received..................: 1.4 GB 12 MB/s
     data_sent......................: 49 MB  405 kB/s
     http_req_blocked...............: min=699ns    max=4.52ms  avg=1.22µs  med=1.09µs  p(95)=1.64µs  p(99)=2.71µs 
     http_req_connecting............: min=0s       max=2.76ms  avg=8ns     med=0s      p(95)=0s      p(99)=0s     
     http_req_duration..............: min=304.14µs max=33.3ms  avg=5.89ms  med=5.42ms  p(95)=8.58ms  p(99)=11.16ms
       { expected_response:true }...: min=304.14µs max=33.3ms  avg=5.89ms  med=5.42ms  p(95)=8.58ms  p(99)=11.16ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 606874
     http_req_receiving.............: min=10.61µs  max=9.98ms  avg=23.99µs med=22.85µs p(95)=31.18µs p(99)=41.1µs 
     http_req_sending...............: min=3.42µs   max=8.24ms  avg=5.38µs  med=4.91µs  p(95)=7.48µs  p(99)=9.97µs 
     http_req_tls_handshaking.......: min=0s       max=0s      avg=0s      med=0s      p(95)=0s      p(99)=0s     
     http_req_waiting...............: min=288.35µs max=33.21ms avg=5.86ms  med=5.39ms  p(95)=8.55ms  p(99)=11.13ms
     http_reqs......................: 606874 5056.905256/s
     iteration_duration.............: min=326.66µs max=36.16ms avg=5.92ms  med=5.45ms  p(95)=8.61ms  p(99)=11.19ms
     iterations.....................: 606874 5056.905256/s
     vus............................: 30     min=30        max=30  
     vus_max........................: 30     min=30        max=30